

{
    "name":"FOS - Trigger Event(s)"
   ,"version":"20.1.0"
   ,"description":"Dynamic Action to trigger an event with an optional data object declaratively.\r\n\u003Ch4\u003EFree Plug-in under MIT License\u003C\/h4\u003E\r\n\u003Cp\u003E\r\nAll FOS plug-ins are released under MIT License, which essentially means it is free for everyone to use, no matter if commercial or private use. \r\n\u003C\/p\u003E\r\n\u003Ch4\u003EOverview\u003C\/h4\u003E\r\n\u003Cp\u003EThe \u003Cstrong\u003EFOS - Trigger Event\u003C\/strong\u003E dynamic action plug-in is used for controlling the branching logic (if\/then\/else) within a dynamic action. It gives you\/developers the declarative ability to fire custom event(s) which other dynamic actions can listen to, whilst giving you the option to cancel the following actions in the current dynamic action. Hence why we use the term branching.\u003C\/p\u003E\n\u003Ch3\u003EConditional Event Firing\u003C\/h3\u003E\n\u003Cp\u003EThe plug-in has the added flexibility of allowing you to define a client-side condition as to whether you fire the event. It is somewhat similar to our \"FOS - Client-side Condition\" dynamic action, but provides more focus on branching of logic through the firing of events.\u003C\/p\u003E\n\u003Ch3\u003EMultiple Events\u003C\/h3\u003E\n\u003Cp\u003EYou can also fire multiple events by comma separating them, as well as defining the \"data\" object that is passed into the event in case you need to transfer extra information. Why wouldn\u0027t I just use multiple actions instead? Our goal is to focus on efficiency and reduce the overall number of actions that developers create. Since we\u0027re firing an event already, we thought we should give you the ability to fire multiple events.\u003C\/p\u003E"
   ,"keywords":[
        "trigger"
       ,"event"
       ,"dynamic action"
       ,"branch"
    ]
   ,"license":"MIT"
   ,"commercial":"No"
   ,"commercially_supported":"Yes"
   ,"homepage":"https:\/\/foex.at\/fos\/"
   ,"bugs":{
        "url":"https:\/\/github.com\/foex-open-source\/fos-trigger-event\/issues"
       ,"email":"support@fos.world"
    }
   ,"author":{
        "name":"FOEX GmbH"
       ,"email":"office@fos.world"
       ,"url":"https:\/\/fos.world\/"
       ,"twitter":"@foexopensource"
    }
   ,"repository":{
        "type":"git"
       ,"url":"https:\/\/github.com\/foex-open-source\/fos-trigger-event.git"
    }
   ,"oracle":{
        "versions":[
            "12.1.0.1"
           ,"12.2.0.1"
           ,"18.0.0.0"
           ,"19.0.0.0"
        ]
       ,"apex":{
            "versions":[
                "19.2.0"
               ,"20.1.0"
            ]
           ,"plugin":{
                "internalName":"COM.FOS.TRIGGER_EVENT"
               ,"type":"dynamic action"
               ,"demo":"https:\/\/fos.world\/ords\/f?p=10000:1040"
               ,"previewImage":"https:\/\/fos.world\/ords\/fos_master_ws\/fos-image\/COM.FOS.TRIGGER_EVENT"
            }
        }
    }
}




